# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'caskroom/drivers'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'storm'
brew 'wget'
cask 'controlplane'
cask 'tigervpn'
cask 'transmission'
cask 'tripmode'
mas 'ForkLift', id: 412448059

# Terminal
brew 'autojump'
brew 'joe'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'

# Améliorations d'interface et usage
cask 'bartender'
cask 'dozer'
cask 'coconutbattery'
cask 'rcdefaultapp'
cask 'WebPQuickLook'
mas 'Amphetamine', id: 937984704
mas 'AutoMute', id: 1118136179
mas 'BetterSnapTool', id: 417375580

# Utilitaires divers
cask 'appcleaner'
cask 'appshelf'
cask 'disk-inventory-x'
cask 'unlox'
cask 'muzzle'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'yemuzip'
mas '1Password', id: 443987910
mas 'Renamer', id: 402286241
mas 'The Unarchiver', id: 425424353

# Backup et synchro
brew 'mackup'
cask 'carbon-copy-cloner'
cask 'backblaze'
cask 'google-drive-file-stream'

# Web
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'

# Développement
brew 'git'
brew 'mariadb'
brew 'node'
brew 'pkg-config'
brew 'ruby'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
# https://github.com/ryanoasis/nerd-fonts#option-4-homebrew-fonts
cask 'font-hack-nerd-font'
cask 'ghostlab'
cask 'github'
cask 'java6'
cask 'meld'
cask 'reflector'
cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
#mas 'Xcode', id: 497799835

# Images
brew 'graphicsmagick'
brew 'gsl'
brew 'imagemagick@6'
cask 'imageoptim'
mas 'Boxy SVG', id: 611658502
mas 'Skitch', id: 425955336
mas 'Sip', id: 507257563

# Vidéos
brew 'ffmpeg'
brew 'youtube-dl'
cask 'catch'
cask 'handbrake'
cask 'molotov'
cask 'subler'
cask 'subsmarine'
cask 'vlc'
mas 'iFlicks 2', id: 731062389
mas 'Screeny', id: 440991524

# Musique
cask 'spotify'
# cask 'xld'
# mas 'Export for iTunes', id: 880764359
mas 'I Love Stars', id: 402642760

# Photo
cask 'adobe-creative-cloud'
mas 'gps4cam', id: 704400176

# Divertissement
cask 'steam'

# Communication
cask 'rambox'
# cask 'skype'
mas 'Slack', id: 803453959
mas 'Tweetbot 3', id: 1384080005

# Bureautique
# cask 'libreoffice'
cask 'macdown'
cask 'netnewswire'
cask 'notion'
