# https://github.com/Homebrew/homebrew-bundle

# -----------------------------------------------------------------------------
# Homebrew taps
# -----------------------------------------------------------------------------

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'nhoizey/cask'

# -----------------------------------------------------------------------------
# Settings
# -----------------------------------------------------------------------------

# Define where to put installed applications
cask_args appdir: '/Applications'

# Allow installation of AppStore applications
brew 'mas'

# -----------------------------------------------------------------------------
# Applications to install
# -----------------------------------------------------------------------------

# Network
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'openvpn'
brew 'rsync'
brew 'wget'
cask 'controlplane'
cask 'ngrok'
cask 'protonvpn'
cask 'transmission'

# Terminal
brew 'autojump'
brew 'joe'
brew 'starship'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'

# UI and usage
brew 'glance-chamburr'
cask 'raycast'
cask 'setapp'
cask 'swiftdefaultappsprefpane'
mas 'Amphetamine', id: 937984704

# Misc utilities
brew 'duti'
cask '1password'
cask 'deepl'
cask 'enca'
cask 'jq'
cask 'keeper-password-manager'
cask 'grandperspective'
cask 'screenflow9'
cask 'yemuzip'

# Backup and sync
cask 'backblaze'
cask 'carbon-copy-cloner'
cask 'dropbox'
cask 'google-drive-file-stream'

# Web
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'

# Development
brew 'git'
brew 'node'
brew 'nvm'
brew 'pkg-config'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
# https://github.com/ryanoasis/nerd-fonts#option-4-homebrew-fonts
cask 'font-hack-nerd-font'
cask 'github'
cask 'meld'
cask 'polypane'
cask 'reflector'
cask 'visual-studio-code'

# Images
cask 'imageoptim'

# Videos
brew 'ffmpeg'
brew 'yt-dlp'
cask 'autosubsync'
cask 'catch'
cask 'handbrake'
cask 'losslesscut'
cask 'mkvtoolnix'
cask 'plex'
cask 'subler'
cask 'subsmarine'
cask 'vlc'

# Photo
cask 'adobe-creative-cloud'

# Communication
cask 'signal'
cask 'whatsapp'
mas 'Slack', id: 803453959
mas 'Ivory for Mastodon by Tapbots', id: 6444602274

# Office and productivity
cask 'microsoft-teams'
cask 'netnewswire'
cask 'obsidian'

# Misc
cask 'yacreader'

# -----------------------------------------------------------------------------
# Visual Studio Code extensions
# -----------------------------------------------------------------------------

# TODO: check if those extensions are all really useful

# Must have
vscode "nhoizey.gremlins"

# VS Code UI
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "johnpapa.vscode-peacock"

# Working with text
vscode "medo64.render-crlf"
vscode "timonwong.shellcheck"
vscode "sandcastle.whitespace"
vscode "brunnerh.insert-unicode"
vscode "zeithaste.cursorCharCode"

# HTML tools
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "vincaslt.highlight-matching-tag"

# Files and folders manipulations
vscode "moshfeu.compare-folders"
vscode "mrmlnc.vscode-duplicate"

# Git tools
vscode "eamodio.gitlens"

# npm tools
vscode "wix.vscode-import-cost"
vscode "christian-kohler.npm-intellisense"
vscode "pflannery.vscode-versionlens"

# File formats/colorizer
vscode "tamasfe.even-better-toml"
vscode "mrmlnc.vscode-apache"
vscode "sharat.vscode-brewfile"
vscode "github.vscode-github-actions"
vscode "mikestead.dotenv"
vscode "ronnidc.nunjucks"
vscode "SomewhatStationery.some-sass"
vscode "joshbolduc.story-explorer"
vscode "jock.svg"

# Markdown tools
vscode "shd101wyy.markdown-preview-enhanced"
vscode "darkriszty.markdown-table-prettify"
vscode "DavidAnson.vscode-markdownlint"
vscode "unifiedjs.vscode-mdx"

# Noctis Theme
vscode "liviuschera.noctis"

# Code formater/beautifier
vscode "esbenp.prettier-vscode"
vscode "mohsen1.prettify-json"
vscode "stylelint.vscode-stylelint"

# Miscelanous
vscode "oderwat.indent-rainbow"
vscode "christian-kohler.path-intellisense"
vscode "MohammadBaqer.better-folding"
vscode "kamikillerto.vscode-colorize"
vscode "GitHub.copilot"
vscode "aaron-bond.better-comments"
