# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
#? tap 'homebrew/core'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Outils système et réseau
brew 'dnsmasq'
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'wget'
mas 'ForkLift', id: 412448059

# Outils pour le terminal
brew 'autojump'
brew 'joe'
cask 'iterm2'

# Utilitaires
cask 'appdelete'
cask 'appshelf'
cask 'bartender'
cask 'coconutbattery'
cask 'controlplane'
cask 'disk-inventory-x'
cask 'macid'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'rcdefaultapp'
cask 'rightzoom'
cask 'yemuzip'
mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'AutoMute', id: 1118136179
mas 'BetterSnapTool', id: 417375580
mas 'Renamer', id: 402286241
mas 'Silent Start', id: 905747757
mas 'Sip', id: 507257563
mas 'Skitch', id: 425955336
mas 'The Unarchiver', id: 425424353

# Outils de backup et synchro
brew 'mackup'
cask 'carbon-copy-cloner'
cask 'crashplan'
cask 'dropbox'
cask 'google-drive'

# Outils Web
cask 'firefox'
cask 'google-chrome'

# Outils de développement
brew 'node'
cask 'duet'
# https://github.com/tonsky/FiraCode/wiki#installing-font
cask 'font-fira-code'
cask 'ghostlab'
cask 'github-desktop'
cask 'iterm2'
cask 'java6'
#cask 'reflector'
cask 'sequel-pro'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
mas 'Opera', id: 404764921
mas 'Xcode', id: 497799835

# Dépendances spécifiques à Jekyll
brew 'graphicsmagick'
brew 'gsl'
brew 'imagemagick@6'
brew 'pkg-config'
brew 'ruby'

# Multimédia
brew 'ffmpeg'
brew 'youtube-dl'
cask 'catch'
cask 'adobe-creative-cloud'
cask 'handbrake'
cask 'licecap'
cask 'logitech-harmony'
cask 'molotov'
cask 'screenflow'
cask 'spotify'
cask 'subler'
cask 'subsmarine'
cask 'transmission'
cask 'vlc'
mas 'Boxy SVG', id: 611658502
mas 'Export for iTunes', id: 880764359
mas 'GIF Brewery 3', id: 1081413713
mas 'gps4cam', id: 704400176
mas 'I Love Stars', id: 402642760
mas 'iFlicks 2', id: 731062389
mas 'Screeny', id: 440991524

# Communication
cask 'colloquy'
cask 'rambox'
cask 'skype'
mas 'Slack', id: 803453959
mas 'Tweetbot', id: 557168941

# Bureautique
cask 'macdown'
mas 'Evernote', id: 406056744
mas 'ReadKit', id: 588726889

# Divertissement
cask 'steam'
